[
  {
    "page": 1,
    "preview": " \n \n \n \nFazail-e-Amal is most famous as the book  by Maulana Muhammad Zakariyya (or actually a \ncombined edition of six smaller books) used by the world-wide movement Jamat-e-Tableegh \n(or Tableeghi Jamat).  \nFamous for their travels, in groups small and large, to virtually all corners of the World, the \nJamat preaches a message centered around the importance of dawah, self-sacrifice and taking \nthe message of the Prophet out to people locally as well as past the comfortable confines of \nones lo"
  },
  {
    "page": 2,
    "preview": "(VoL -I )  \nRevised translation of \nTABLIGHI NISAAB \nLIST OF BOOKS \nby Shaikhul Hadith \nMaulana Muhammad Zakariyya Kaandhlawi \n1. \t\nStories of the Sahaabah \n2. \t\nVirtues of the Holy Qur'aan \n3. \t\nVirtues of Salaat \n4. \t\nVirtues of Zikr \n5. \t\nVirtues of Tabligh \n6. \t\nVirtues of Ramadhaan \nby Maulana Ihtishaamul Hasan Kaandhlawi \n7. \t\nMuslim degeneration \nand it only remedy. \nby Maulana Aashiq Ilaahi \n8. \t\nSix Fundamentals \nI \\ \nGlossary \n"
  },
  {
    "page": 3,
    "preview": "Stories of the \nSAHAABAH \nRevised translation of \nthe Urdu book Hikayaat-e-Sahaabah \nby\nShaikhul Hadith Maulana Muhammad Zakariyya Kaandhlawi \ntranslated by \nAbdul Rashid Arshad \n"
  },
  {
    "page": 4,
    "preview": "\"Translatcr's Note' \nThe original Arabic names and terms which are \nunderstood all over the Muslim world, have been retained \nuntranslated. These are often printed within 'Commas' and \nhave been explained in the Appendix (Glossary). so as to fa-\ncilitate their correct pronunciation. \nThe symbol (') used in such words as 'Ja'far, ka'abah' \nstands for the Arabic Alphabet ( & 1. The symbol(') stands \nfor prolonged 'a' sound as in 'Qur'an'. \nCONTENTS \nFOREWORD . . . .. . ... . .. . . . .. . .... . ."
  },
  {
    "page": 5,
    "preview": "4 \nStories of the Sahaabah \nAbu Bakr and the fear of Allah .................. \n39 \nUmar and the fear of Allah ...................... \n40 \nAn admonition by Abdullah-bin-Abbas .......... \n43 \nThe Prophet's passing near the ruins of Thamud . . .  \n44 \nKa'ab's failure to join theTabuk Expedition ....... \n45 \nThe Prophet's reprimand on the Sahabah's laugh- \ning .......................................... \n53 \nHanzlah's fear of Nifaq ......................... \n53 \nA few Miscellaneous Stories about the "
  },
  {
    "page": 6,
    "preview": "CHAPTER VI \nSYMPATHY AM) SELF SACRIFICE \nPage No. \nFeeding the guest in darkness ................... \n97 \nFeedinga fasting Sahabi ........................ \n98 \nOver payment of Zakaat ........................ \n98 \nUmar trying to emulate Abu Bakr ................ \n100 \nSahabah dying thirsty for others ................. \n101 \nHamzah's shroud ............................. \n101 \nThe story of the goat-head ...................... \n103 \nUmar's wife acts as a midwife ................... \n104 \nAbu Talhah "
  },
  {
    "page": 7,
    "preview": "Stories of the Sahaabah \nCHAPTER IX \nPLEASING THE PROPHET \nIbn-Amar burns his shawl ...................... \nAn Ansari razes his building ................... \nSahabah's discard of sheets of cloth .............. \nWail has his hair cut ........................... \nKhuraim Asadi discards what is not liked by the \nProphet ...................................... \nIbn-Umar discards speaking with his son . . . . . . . . .  \nIbnTUmar replies a question .................... \nIbn-Mughfal severs relations wi"
  },
  {
    "page": 8,
    "preview": "10 \nStories of the Sahaabah \n9. Umme Habibah ........................... \n207 \n10. Safiyyah ................................. \n208 \n11. Maimoonah .............................. \n209 \nThe sons of the Prophet ........................ \n210 \nThe daughters of the Prophet ................... \n211 \n1. Zainab ................................... \n211 \n2. Ruqayyah ................................ \n212 \n3. Umme-Kulsum ........................... \n212 \n4. Fatimah .................................. \n214 \nCHA"
  },
  {
    "page": 9,
    "preview": "AUTHOR'S FOREWORD \nWe glorify Allah and ask blessings and salutations of \npeace for the noble Prophet (Sallallaho alaihe wasallam) \nand his companions and those who follow him in up-\nholding the cause of the right religion. \nIt was in the year 1353 A.H. that an eminent Sheikh, \nwho is my patron and for whom I have every respect, en- \njoined me to compile a book containing stories of the com- \npanions of the Holy Prophet (Sallallaho alaihe wasallam), \nwith special reference to the Faith and Pract"
  },
  {
    "page": 10,
    "preview": "14 \nStories of the Sahaabah \n12 \nstayed with me even after reaching home. Then I hoke \nthe shackles that had kept me away from Allah, and set \nout on His path to seek His pleasure.'' \nSuch is the case with religious books. A cursory reading of \nthese seldom produces the desired effect, and a frequent \nand thorough study thereof is therefore necessary. \nFor the convenience of the readers, and to interest \nthem, I have divided this book into the following twelve \nchapters together with an epilogue"
  },
  {
    "page": 11,
    "preview": "34 \n16 \nStories of the Sahaabah \n2 \nCh. I: Steadfastness in the Face of Hardships \n17 / \nplainly told him that they did not like his stay in their \ntown. The Prophet (Sallallaho alaihe wasallam) had ex-\npected a civil, even a cordial treatment and due courtesy in \nspeech from them, as they were the heads of the clan. But \none of them sneered: \n\"Hey, Allah has made you a Prophet!\" \nThe other exclaimed with derision: \n\"Could Allah not lay His hand on anyone else, beside \nyou to make him His Prophe"
  },
  {
    "page": 12,
    "preview": "18 \n19 \nStories of the Sahaabah \nProphet (Sallallaho alaihe wasallam)? Look, even after so \nmuch suffering at the hands of the Taif mob, he neither \ncurses them nor does he work for any revenge, even when \nhe has the full opportunity to do so. \n2. \t\nMartyrdom of Hadhrat Anas bin Nadhr (Radhiyallaho \nanho): \nHadhrat Anas bin Nadhr (Radhiyallaho anho) was one \nof the Sahabah who could not take part in the campaign of \nBadr. He very much regretted to have missed the honour of \nparticipating in the "
  },
  {
    "page": 13,
    "preview": "20 \nStories of the Sahaabah \nI \nCh. I: Steadfastness in the Face of Hardships \n21 \nson with the Muslims even at the personal request of the \nProphet (Sallallaho alaihe wasallam), and would have for- \ngone the truce even. Abu Jandal (Radhiyallaho anho) \ncounting his hardships remonstrated at the top of his voice \nbut, much to the grief of the Sahabah, the Prophet (Salalla- \nho alaihe wasallam) agreed to his return. He however en- \njoined patience on him saying: \n\"Do not be distressed, Hadhrat Abu"
  },
  {
    "page": 14,
    "preview": "0 \n22 \nStories of the Sahaabah \nHe was whipped at night and with the cuts thus received, \nmade to lie on the burning ground during the day to make \nhim either forsake Islam or to die a lingering death from \nwounds. The torturers would get tired and take turns (Abu \nJahl, Umayyah and others) and vie with one another in \nafflicting more and more painful punishment, but Hadhrat \nBilal (Radhiyallaho anho) would not yield. At last Abu \nBakr (Radhiyallaho anho) bought his freedom, and he be- \ncame a f"
  },
  {
    "page": 15,
    "preview": "24 \nStories of the Sahaabah \nan undertaking from Hadhrat Ali (Radhiyallaho anho) that \nhe would speak the truth, and then he enquired from him \nabout Muhammad (Sallallaho alaihe wasallain). Hadhrat \nAli (Radhiyallaho anho) replied: \n\"He is verily the Prophet of Allah. You accompany me \ntomorrow and I shall take you to him. But you have to \nbe very careful, lest people come to know of your asso- \nciation with me, and you get into trouble. When on our \nway I apprehend some trouble, I shall get asi"
  },
  {
    "page": 16,
    "preview": "26 \nStories of the Sahaabah \nHadhrat Khabbab (Radhiyallaho anho) narrates: \n\"The Prophet (Sallallaho alaihe wasallam) once per-\nformed an unusually long rakaat while leading a Sa- \nlaat. When the Sahabah mentioned it to him, he said, \n\"This was a Salaat of yearning and humility. I asked \nthree boons from Allah. I besought Him: \n'0,Allah! Let not my Ummat perish by famine; let not \nmy Ummat be annihilated by an enemy gaining an \nupper hand on them; and let not my Ummat fight \namong themselves.' \n"
  },
  {
    "page": 17,
    "preview": "28 \nStories of the Sahaabah \nAnd they agreed. He told them the whereabouts of his \nmoney, and they allowed him to proceed to Madinah. At \nthis, Allah revealed the following verse of the Qur'an to the \nProphet (Sallallaho alaihe wasallam): \n\"And of mankind is he who would sell himself, seek- \ning the pleasure of Allah, and Allah has compassion \non His bondsmen.\" \nThe Prophet (Sallallaho alaihe wasallam) was at that time \nat Quba. When he saw Hadhrat Sohaib (Radhiyallaho anho) \ncoming, he remarked"
  },
  {
    "page": 18,
    "preview": "30 \n31 \nStories of the Sahaabah \nbeside himself with rage and fell on him, pulling his beard \nand beating him most savagely. When the sister intervened, \nhe smote her so violently on her face that it bled most \nprofusely. She was, after all, 'Umar's sister; she burst out: \n\"'Umar! we are beaten only because we have become \nMuslims. Listen! we are determined to die as Muslims. \nYou are free to do whatever you like.\" \nWhen 'Umar had cooled down and felt a bit ashamed over \nhis sister's bleeding, h"
  },
  {
    "page": 19,
    "preview": "32 \nStories of the Sahaabah \nand kith and kin have sent us to take them back to \ntheir country. We beseech you to make them over to \nus.\" \nThe king replied: \n\"We cannot make over the people who have sought \nour shelter, without proper investigation. Let us call \nthem to our presence, and hear them out. If your \ncharge of apostasy against them is genuine, we shall \nmake them over to you.\" \nThe king thereupon summoned the Muslims to his court. \nThey were at first greatly distressed and did not kno"
  },
  {
    "page": 20,
    "preview": "34 \nStories of the Sahaabah \npresents they had brought f.or him, and said to the Mus- \nlims: \n\"Go and live in peace. If anybody ill-treats you, he will \nhave to pay heavily for it.\" \nA royal declaration was also issued to that effect. This \nenhanced the prestige of the Muslims in the country, and \nthe Qureysh delegation had to return crestfallen. \nThis failure of the Qureysh embassy to Abyssinia, and \nthe triumph of Muslims over them, led to an increase in the \nexasperation of the idolaters; the"
  }
]